Repository: yousefZX9900/MuteLock
Catalog: Preferences/Resources/*.lproj/Localizable.strings
Languages: ar

# SECTION_PROTECTION
source: PROTECTION
ar: الحماية

source: Enable MuteLock
ar: تفعيل MuteLock

source: Lock Camera
ar: قفل الكاميرا

source: Lock Microphone
ar: قفل الميكروفون

# SECTION_TEMP_UNLOCK
source: TEMPORARY UNLOCK
ar: فتح مؤقت

# REQUEST_UNLOCK
source: Unlock for 5 Minutes
ar: فتح لمدة 5 دقائق

# TAP_TO_LOCK
source: Lock Now
ar: قفل الآن

# UNLOCK_FOOTER
source: Temporarily allow camera/microphone access for 5 minutes.
ar: السماح مؤقتاً بالوصول للكاميرا والميكروفون لمدة 5 دقائق.

# SECTION_LOG
source: BLOCKED ATTEMPTS
ar: محاولات الوصول المحظورة

source: View Log
ar: عرض السجل

source: Clear Log
ar: مسح السجل

# LOG_EMPTY
source: No blocked attempts yet
ar: لا توجد محاولات محظورة

# LOG_CAMERA
source: Camera
ar: الكاميرا

# LOG_MIC
source: Microphone
ar: الميكروفون

# SECTION_DEVELOPER
source: Developer
ar: المطور

# TWITTER
source: Twitter (@yousef_dev921)
ar: تويتر: @yousef_dev921

# DONATE
source: Donate (Buy me a Coffee)
ar: ادعمني

source: OK
ar: موافق

source: Unlocked
ar: تم الفتح

# UNLOCK_MESSAGE
source: Camera and microphone unlocked for 5 minutes.
ar: تم فتح الكاميرا والميكروفون لمدة 5 دقائق.

# DANGER_ZONE_FOOTER
source: Enabling Extreme Protection will KILL the media server (mediaserverd). Camera & Audio will completely stop working until you disable this and respring/reboot.
ar: تفعيل الحماية القصوى سيؤدي إلى قتل خادم الوسائط (mediaserverd). الكاميرا والصوت سيتوقفان تماماً عن العمل حتى تقوم بتعطيل الخيار وعمل Respring/Reboot.

source: Danger Zone
ar: منطقة الخطر

source: Unknown
ar: غير معروف

source: Extreme Protection
ar: الحماية القصوى (Killer)

source: Warning
ar: تحذير هام

# EXTREME_PROTECTION_MSG
source: You are about to enable Extreme Protection. This will KILL the media server repeatedly. ⚠️ Potential Risks: 1- High battery drain. 2- System instability. 3- Risk of Boot Loop. Device will Respring IMMEDIATELY to apply changes. Are you sure?
ar: أنت على وشك تفعيل وضع (الحماية القصوى). هذا الخيار سيقوم بقتل خادم الوسائط فوراً وبشكل متكرر. ⚠️ المخاطر المحتملة: 1- استنزاف عالٍ جداً للبطارية. 2- عدم استقرار في النظام. 3- احتمال تعليق الجهاز عند التشغيل (Boot Loop). سيقوم الجهاز بعمل Respring فوراً لتطبيق التغيير. هل أنت متأكد؟

# DISABLE_EXTREME_TITLE
source: Disable Extreme Protection
ar: تعطيل الحماية القصوى

# DISABLE_EXTREME_MSG
source: To restore media server functionality, a Respring is required. Device will Respring immediately.
ar: لإعادة خادم الوسائط للعمل بشكل طبيعي، يجب عمل Respring للجهاز. سيتم عمل Respring فوراً.

# DISABLE_AND_RESPRING
source: Disable & Respring
ar: عطّل واعمل Respring

source: Cancel
ar: إلغاء

# TheNuclearOption
source: Enable (Nuclear Option)
ar: تفعيل (الخيار النووي)
